Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	Если НЕ (ВКМ_Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание И 
			(Дата >= ВКМ_Договор.ВКМ_НачалоДействияДоговора И Дата <= ВКМ_Договор.ВКМ_ОкончаниеДействияДоговора)) Тогда
				Отказ=Истина;
				Сообщить("Документ с просроченным договором абонентского обслуживания провести нельзя!");
	Иначе
	// регистр ВКМ_ВыполненныеКлиентуРаботы
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ВКМ_Клиент = ВКМ_Клиент;
			Движение.ВКМ_Договор = ВКМ_Договор;
			Движение.ВКМ_КоличествоЧасов = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплате;
			Движение.ВКМ_СуммаКОплате = ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы * ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплате 
			+ ВКМ_Договор.ВКМ_СуммаАбонентскойПлаты;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры