#Область ПрограммныйИнтерфейс
Функция СоздатьДокументыНаСервере(Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &Начало И &Конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Ссылка КАК Договор,
	|	ВТ_Договоры.Владелец КАК Контрагент,
	|	ВТ_Договоры.Организация КАК Организация,
	|	ВТ_Документ.Документ КАК Документ,
	|	ВТ_Договоры.Ссылка.Представление КАК ПредставлениеДоговор
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документ КАК ВТ_Документ
	|		ПО ВТ_Договоры.Ссылка = ВТ_Документ.Документ.Договор
	|ГДЕ
	|	ВТ_Документ.Документ ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Начало", Период.ДатаНачала);	
	Запрос.УстановитьПараметр("Конец", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    МассивДанных = Новый Массив;
	
	Пока Выборка.Следующий() Цикл	
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = Период.ДатаНачала;
		НовыйДокумент.Организация = Выборка.Организация;
		НовыйДокумент.Контрагент = Выборка.Контрагент;
		НовыйДокумент.Договор = Выборка.Договор;
		НовыйДокумент.Основание = Выборка.Договор;
		НовыйДокумент.Заполнить(Выборка);
		Если НовыйДокумент.Основание = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
			НовыйДокумент.Основание = Выборка.Договор;
		КонецЕсли;
		// исправление по замечанию №4 24.07.25
		НовыйДокумент.ВыполнитьАвтозаполнение();			
		Если  НовыйДокумент.ПроверитьЗаполнение() Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Договор", НовыйДокумент.Договор);
			СтруктураДанных.Вставить("Документ", НовыйДокумент.Ссылка);		
			МассивДанных.Добавить(СтруктураДанных);
		КонецЕсли;
		
	КонецЦикла;
			
	Возврат МассивДанных;		
		
КонецФункции
#КонецОбласти