#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеВводаНДД = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
	ПолеВводаНДД.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаНДД.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	ПолеВводаНДД.Видимость = Ложь;
	
	ПолеВводаКДД = Элементы.Добавить("КонецДействияДоговора", Тип("ПолеФормы"));
	ПолеВводаКДД.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаКДД.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";
	ПолеВводаКДД.Видимость = Ложь;
	
	ПолеВводаСАП = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеВводаСАП.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаСАП.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеВводаСАП.Видимость = Ложь;
	
	ПолеВводаСЧР = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВводаСЧР.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаСЧР.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ПолеВводаСЧР.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВывестиРеквизиты();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВывестиРеквизиты();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВывестиРеквизиты()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.НачалоДействияДоговора.Видимость = Истина;
		Элементы.КонецДействияДоговора.Видимость = Истина;
		Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.НачалоДействияДоговора.Видимость = Ложь;
		Элементы.КонецДействияДоговора.Видимость = Ложь;
		Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти
