#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;	
	ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере();	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
			
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере()
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыНаСервере", Объект.Период);	
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧ(Данные)

	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений = РеквизитФормыВЗначение("СписокДокументов");
	Для Каждого Строка Из Данные Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТаблицаЗначений, "СписокДокументов");
	Элементы.СписокДокументов.КоманднаяПанель.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда		
		Данные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьТЧ(Данные);		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти